index.org
#+TITLE:  Материалы к учебным курсам НГТУ
#+SETUPFILE: ../../css/level-0.orgcss

** Алгоритмы и структуры данных (весна 2022)

*** Лекции

 - [[file:ads/lections/lec01/lec01.pdf][Лекция 1. Определение и свойства алгоритмов]]
 - [[file:ads/lections/lec02/lec02.pdf][Лекция 2. Сложность алгоритмов]]
 - [[file:ads/lections/lec03/lec03.pdf][Лекция 3. Методы разработки и анализа алгоритмов]]
 - [[file:ads/lections/lec04/lec04.pdf][Лекция 4. Структуры данных и их классификация]]
 - [[file:ads/lections/lec05/lec05.pdf][Лекция 5. Простые алгоритмы сортировки]]
 - [[file:ads/lections/lec06/lec06.pdf][Лекция 6. Продвинутые алгоритмы сортировки]]
 - [[file:ads/lections/lec07/lec07.pdf][Лекция 7. Стек и очередь на массиве]]
 - [[file:ads/lections/lec08/lec08.pdf][Лекция 8. Связанные списки (1)]]
 - [[file:ads/lections/lec09/lec09.pdf][Лекция 9. Стек и очередь на списках]]
 - [[file:ads/lections/lec10/lec10.pdf][Лекция 10. Связанные списки (2)]]
 - [[file:ads/lections/lec11/lec11.pdf][Лекция 11. Бинарные деревья поиска]]
 - [[file:ads/lections/lec12/lec12.pdf][Лекция 12. AVL-деревья ]]
 - [[file:ads/lections/lec13/lec13.pdf][Лекция 13. Красно-черные деревья ]]
 - [[file:ads/lections/lec14/lec14.pdf][Лекция 14. Хеш-таблицы ]]


*** Конспекты практических занятий

 - [[https://github.com/NNTU-CS/ADS-class-01.git][Итерация и рекурсия]]
 - [[https://github.com/NNTU-CS/ADS-class-02.git][Алгоритмы на массивах]]
 - [[https://github.com/NNTU-CS/ADS-class-03.git][Стек на массиве. Вычисление арифметических выражений]]
 - [[https://github.com/NNTU-CS/ADS-class-04.git][Очередь на массиве. Кольцевой буфер. Очередь с приоритетом]]
 - [[https://github.com/NNTU-CS/ADS-class-05.git][Стек и очередь на списке]]

*** Лабораторные задания

Инструкции к выполнению заданий находятся [[https://github.com/NNTU-CS/ADS-Information.git][здесь]]
Список участников/веток находятся [[file:ads/lists/branches.pdf][здесь]]


| Задание                                                                 | Репозиторий |  Срок |
|-------------------------------------------------------------------------+-------------+-------|
| Задание 0. Алгоритм Евклида                                             | [[https://github.com/NNTU-CS/ads-0.git][ADS-0]]       | 31.05 |
| Задание 1. Разработка библиотеки для работы с простыми (prime)  числами | [[https://github.com/NNTU-CS/ads-1.git][ADS-1]]       | 27.02 |
| Задание 2. Численные методы для вычисления трансцедентных функций       | [[https://github.com/NNTU-CS/ads-2.git][ADS-2]]       | 06.03 |
| Задание 3. Разработка модифицированного алгоритма бинарного поиска      | [[https://github.com/NNTU-CS/ads-3.git][ADS-3]]       | 13.03 |
| Задание 4. Подсчет всех пар целых чисел в массиве                       | [[https://github.com/NNTU-CS/ads-4.git][ADS-4]]       | 27.03 |
| Задание 5. Стек. Вычисление арифметических выражений                    | [[https://github.com/NNTU-CS/ads-5.git][ADS-5]]       | 03.04 |
| Задание 6. Очередь. Реализация очереди с приоритетами на массиве        | [[https://github.com/NNTU-CS/ads-6.git][ADS-6]]       | 17.04 |
| Задание 7. Очередь. Реализация очереди с приоритетами на списке         | [[https://github.com/NNTU-CS/ads-7.git][ADS-7]]       | 01.05 |
| Задание 8. Задача про круговой поезд                                    | [[https://github.com/NNTU-CS/ads-8.git][ADS-8]]       | 08.05 |
| Задание 9. Частотный анализ слов на основе бинарного дерева             | [[https://github.com/NNTU-CS/ads-9.git][ADS-9]]       | 29.05 |
| Задание 10. Генерация перестановок с помощью дерева вариантов           | [[https://github.com/NNTU-CS/ads-10.git][ADS-10]]      | 05.06 |


*** Вопросы к экзамену (версия 1 от 27.05)

- [[file:ads/questions/questions.pdf][Вопросы]]


*** Дополнительно

-  [[https://google.github.io/styleguide/cppguide.html][Google C++ Style Guide]]
-  [[https://habr.com/ru/post/480422/][Руководство Google по стилю в C++]]


*** Список литературы и полезных интернет-источников

- /Кормен Т.,Лейзерсон Ч., Ривест Р./, *Алгоритмы: построение и анализ*, 3-е издение. Вильямс, 2019.
- /Хайнеман Джордж, Поллис Гари./ *Алгоритмы. Справочник с примерами на C, C++, Java и Python*. Вильямс, 2017.
- /Скиена Стивен С./ *Алгоритмы. Руководство по разработке.* БХВ-Петербург, 2018.
- /Кормен Томас Х./ *Алгоритмы. Вводный курс.* Диалектика-Вильямс, 2020.

- /Рафгарден Тим./ *Совершенный алгоритм. Графовые алгоритмы и структуры данных.* Питер, 2022.
- /Рафгарден Тим./ *Совершенный алгоритм. Алгоритмы для NP-трудных задач.* Прогресс книга, 2021.
- /Рафгарден Тим./ *Совершенный алгоритм. Основы.* Питер, 2019.

- /Берд Ричард./ *Жемчужины проектирования алгоритмов. Функциональный подход.* ДМК Пресс. 2015.
- /Стюарт Том./ *Теория вычислений для программистов.* ДМК Пресс, 2016.

- /Паронджанов Владимир./ *Учись писать, читать и понимать алгоритмы.* ДМК Пресс, 2016.
- /Бхаргава Адитья./ *Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих.* Питер, 2019.
- /Дасгупта С., Пападимитриу Х., Вазирани У./ *Алгоритмы.* МЦНМО 2014

- /Ахо А., Хопкрофт Д., Ульман Д./ *Структуры данных и алгоритмы.* Вильямс, 2016.
- /Ахо, Ульман, Хопкрофт/: *Разработка и анализ компьютерных алгоритмов.* Вильямс, 2021.
- /Круз Р.Л./ *Структуры данных и проектирование программ*. М.: Бином, 2017.
- /Д. Кнут./ *Искусство программирования Т.1-3*,Вильямс,2019
- /Седжвик Р./ *Алгоритмы на C++.* Вильямс, 2019.
- /Топп У., Форд У./ *Структуры данных в С++.* М.: Бином, 1999.


- Алгоритмы. Методы. Исходники http://algolist.manual.ru
- MAXimal http://e-maxx.ru/algo/
- Визуализатор алгоритмов https://algorithm-visualizer.org
- Data Structure Visualizations https://www.cs.usfca.edu/%7Egalles/visualization/Algorithms.html
- https://www.geeksforgeeks.org/fundamentals-of-algorithms/
- Анимация алгоритмов сортировки https://www.toptal.com/developers/sorting-algorithms
- Visualising data structures and algorithms through animation https://visualgo.net/en
- [[https://codonaft.com/алгоритмы-и-структуры-данных-простыми-словами/?utm_source=youtube&utm_medium=description&utm_campaign=social][Алгоритмы и структуры данных простыми словами]]

# ** Математическая логика и теория алгоритмов
#  :PROPERTIES:
#   :CUSTOM_ID: mlta
# :END:

# _Внимание!_

# Для сдачи исследовательской работы необходимо подготовить электронный документ в формате PDF (можно экспортировать из Word), содержащий стандартный набор разделов:

# - титульный лист;
# - содержание;
# - основной текст;
# - заключение;
# - список использованных источников (обязательно!);


# - [[file:mlta/themes.html][Темы исследовательских работ летней практики (2015)]]
# - [[file:../../useful/books.html#mlta][Список литературы]]


# ** Методы и средства проектирования ИСТ
#  :PROPERTIES:
#  :CUSTOM_ID: pris
# :END:

# *** Расписание занятий на ВЦ (1 корпус)

# | День | Неделя | Время |  Ауд |
# |------+--------+-------+------|
# | Птн  | нч     | 13:15 | 1236 |
# |      | чт     | 13:15 | 1236 |
# |------+--------+-------+------|


# ** Объектно-ориентированное программирование
# :PROPERTIES:
#  :CUSTOM_ID: oop
# :END:

# *** Расписание занятий на ВЦ (1 корпус)

# | День | Неделя | Время |  Ауд |
# |------+--------+-------+------|
# | Пон  | чт     | 15:00 | 1236 |
# |------+--------+-------+------|
# | Втр  | нч     | 09:20 | 1236 |
# |      |        | 13:15 | 1236 |
# |------+--------+-------+------|
# | Чтв  | чт     | 11:10 | 1236 |
# |------+--------+-------+------|
# | Птн  | нч     | 13:15 | 1236 |
# |      | чт     | 13:15 | 1236 |
# |------+--------+-------+------|

# Занятия в субботу планируются в ноябре-декабре.

# *** Темы курсовых работ

# *** Методические материалы

# - [[file:oop/oop-labs.pdf][Методические указания к выполнению лабораторных работ 1-4 (Логанов С.В.)]]
# - [[file:oop/oop-kp.pdf][Методические указания по выполнению курсовой работы (Логанов С.В.)]]



# ** Методы и средства проектирования ИС (осень 2021)

# -  [[https://github.com/NNTU-CS/ISThemes-2021.git][Темы курсовой работы]]



# ** Объектно-ориентированное программирование (осень 2021)

# -  [[https://github.com/NNTU-CS/OOPThemes-2021.git][Темы курсовой работы]]
# -  [[file:oop/content2021.pdf][Состав курсовой работы]]
