index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Материалы к учебным курсам НГТУ</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Материалы к учебным курсам НГТУ</h1>



<div id="outline-container-org20161ba" class="outline-2">
<h2 id="ads"><a id="org20161ba"></a>Алгоритмы и структуры данных (весна 2023)</h2>


<div id="outline-container-orgfc80b7d" class="outline-3">
<h3 id="orgfc80b7d">Лекции</h3>
<div class="outline-text-3" id="text-orgfc80b7d">
<ul class="org-ul">
<li><a href="ads/lections/lec01/lec01.pdf">Лекция 1. Определение и свойства алгоритмов</a></li>
<li><a href="ads/lections/lec02/lec02.pdf">Лекция 2. Сложность алгоритмов</a></li>
<li><a href="ads/lections/lec03/lec03.pdf">Лекция 3. Методы разработки и анализа алгоритмов</a></li>
<li><a href="ads/lections/lec04/lec04.pdf">Лекция 4. Структуры данных и их классификация</a></li>
<li><a href="ads/lections/lec05/lec05.pdf">Лекция 5. Простые алгоритмы сортировки</a></li>
<li><a href="ads/lections/lec06/lec06.pdf">Лекция 6. Продвинутые алгоритмы сортировки</a></li>
<li><a href="ads/lections/lec07/lec07.pdf">Лекция 7. Стек и очередь на массиве</a></li>
<li><a href="ads/lections/lec08/lec08.pdf">Лекция 8. Связанные списки (1)</a></li>
<li><a href="ads/lections/lec09/lec09.pdf">Лекция 9. Стек и очередь на списках</a></li>
<li><a href="ads/lections/lec10/lec10.pdf">Лекция 10. Связанные списки (2)</a></li>
<li><a href="ads/lections/lec11/lec11.pdf">Лекция 11. Бинарные деревья поиска</a></li>
<li><a href="ads/lections/lec12/lec12.pdf">Лекция 12. AVL-деревья </a></li>
<li><a href="ads/lections/lec13/lec13.pdf">Лекция 13. RB-деревья </a></li>
<li><a href="ads/lections/lec14/lec14.pdf">Лекция 14. Хеш-таблицы </a></li>
<li><a href="ads/lections/lec15/lec15.pdf">Лекция 15. Алгоритмы на графах </a></li>
</ul>
</div>
</div>


<div id="outline-container-org77c2a7c" class="outline-3">
<h3 id="org77c2a7c">Конспекты практических занятий</h3>
<div class="outline-text-3" id="text-org77c2a7c">
<ul class="org-ul">
<li><a href="https://github.com/NNTU-CS/ADS-class-01.git">Итерация и рекурсия</a></li>
<li><a href="https://github.com/NNTU-CS/ADS-class-02.git">Алгоритмы на массивах</a></li>
<li><a href="https://github.com/NNTU-CS/ADS-class-03.git">Стек на массиве. Вычисление арифметических выражений</a></li>
<li><a href="https://github.com/NNTU-CS/ADS-class-04.git">Очередь на массиве. Кольцевой буфер. Очередь с приоритетом</a></li>
<li><a href="https://github.com/NNTU-CS/ADS-class-05.git">Стек и очередь на списке</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6036a21" class="outline-3">
<h3 id="org6036a21">Лабораторные задания</h3>
<div class="outline-text-3" id="text-org6036a21">
<p>
Инструкции к выполнению заданий находятся <a href="https://github.com/NNTU-CS/ADS-Information.git">здесь</a>
Список участников/веток находятся <a href="ads/lists/branches.pdf">здесь</a>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Задание</th>
<th scope="col" class="org-left">Репозиторий</th>
<th scope="col" class="org-right">Срок</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Задание 0. Алгоритм Евклида</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-0.git">ADS-0</a></td>
<td class="org-right">31.05</td>
</tr>

<tr>
<td class="org-left">Задание 1. Разработка библиотеки для работы с простыми (prime)  числами</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-1.git">ADS-1</a></td>
<td class="org-right">27.02</td>
</tr>

<tr>
<td class="org-left">Задание 2. Численные методы для вычисления трансцедентных функций</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-2.git">ADS-2</a></td>
<td class="org-right">06.03</td>
</tr>

<tr>
<td class="org-left">Задание 3. Разработка модифицированного алгоритма бинарного поиска</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-3.git">ADS-3</a></td>
<td class="org-right">13.03</td>
</tr>

<tr>
<td class="org-left">Задание 4. Подсчет всех пар целых чисел в массиве</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-4.git">ADS-4</a></td>
<td class="org-right">27.03</td>
</tr>

<tr>
<td class="org-left">Задание 5. Стек. Вычисление арифметических выражений</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-5.git">ADS-5</a></td>
<td class="org-right">03.04</td>
</tr>

<tr>
<td class="org-left">Задание 6. Очередь. Реализация очереди с приоритетами на массиве</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-6.git">ADS-6</a></td>
<td class="org-right">17.04</td>
</tr>

<tr>
<td class="org-left">Задание 7. Очередь. Реализация очереди с приоритетами на списке</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-7.git">ADS-7</a></td>
<td class="org-right">01.05</td>
</tr>

<tr>
<td class="org-left">Задание 8. Задача про круговой поезд</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-8.git">ADS-8</a></td>
<td class="org-right">08.05</td>
</tr>

<tr>
<td class="org-left">Задание 9. Частотный анализ слов на основе бинарного дерева</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-9.git">ADS-9</a></td>
<td class="org-right">29.05</td>
</tr>

<tr>
<td class="org-left">Задание 10. Генерация перестановок с помощью дерева вариантов</td>
<td class="org-left"><a href="https://github.com/NNTU-CS/ads-10.git">ADS-10</a></td>
<td class="org-right">05.06</td>
</tr>
</tbody>
</table>
</div>
</div>

<div class="outline-3">
<h3> Вопросы к экзамену</h3>
<div class="outline-text-3">
<p>
<a href="ads/questions/questions.pdf">версия 1 от 28 мая</a>
</p>


<div id="outline-container-orgfde3b0f" class="outline-3">
<h3 id="orgfde3b0f">Дополнительно</h3>
<div class="outline-text-3" id="text-orgfde3b0f">
<ul class="org-ul">
<li><a href="https://google.github.io/styleguide/cppguide.html">Google C++ Style Guide</a></li>
<li><a href="https://habr.com/ru/post/480422/">Руководство Google по стилю в C++</a></li>
</ul>
</div>
</div>


<div id="outline-container-org763c7c8" class="outline-3">
<h3 id="org763c7c8">Список литературы и полезных интернет-источников</h3>
<div class="outline-text-3" id="text-org763c7c8">
<ul class="org-ul">
<li><i>Кормен Т.,Лейзерсон Ч., Ривест Р.</i>, <b>Алгоритмы: построение и анализ</b>, 3-е издение. Вильямс, 2019.</li>
<li><i>Хайнеман Джордж, Поллис Гари.</i> <b>Алгоритмы. Справочник с примерами на C, C++, Java и Python</b>. Вильямс, 2017.</li>
<li><i>Скиена Стивен С.</i> <b>Алгоритмы. Руководство по разработке.</b> БХВ-Петербург, 2018.</li>
<li><i>Кормен Томас Х.</i> <b>Алгоритмы. Вводный курс.</b> Диалектика-Вильямс, 2020.</li>

<li><i>Рафгарден Тим.</i> <b>Совершенный алгоритм. Графовые алгоритмы и структуры данных.</b> Питер, 2022.</li>
<li><i>Рафгарден Тим.</i> <b>Совершенный алгоритм. Алгоритмы для NP-трудных задач.</b> Прогресс книга, 2021.</li>
<li><i>Рафгарден Тим.</i> <b>Совершенный алгоритм. Основы.</b> Питер, 2019.</li>

<li><i>Берд Ричард.</i> <b>Жемчужины проектирования алгоритмов. Функциональный подход.</b> ДМК Пресс. 2015.</li>
<li><i>Стюарт Том.</i> <b>Теория вычислений для программистов.</b> ДМК Пресс, 2016.</li>

<li><i>Паронджанов Владимир.</i> <b>Учись писать, читать и понимать алгоритмы.</b> ДМК Пресс, 2016.</li>
<li><i>Бхаргава Адитья.</i> <b>Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих.</b> Питер, 2019.</li>
<li><i>Дасгупта С., Пападимитриу Х., Вазирани У.</i> <b>Алгоритмы.</b> МЦНМО 2014</li>

<li><i>Ахо А., Хопкрофт Д., Ульман Д.</i> <b>Структуры данных и алгоритмы.</b> Вильямс, 2016.</li>
<li><i>Ахо, Ульман, Хопкрофт</i>: <b>Разработка и анализ компьютерных алгоритмов.</b> Вильямс, 2021.</li>
<li><i>Круз Р.Л.</i> <b>Структуры данных и проектирование программ</b>. М.: Бином, 2017.</li>
<li><i>Д. Кнут.</i> <b>Искусство программирования Т.1-3</b>,Вильямс,2019</li>
<li><i>Седжвик Р.</i> <b>Алгоритмы на C++.</b> Вильямс, 2019.</li>
<li><i>Топп У., Форд У.</i> <b>Структуры данных в С++.</b> М.: Бином, 1999.</li>
</ul>


<ul class="org-ul">
<li>Алгоритмы. Методы. Исходники <a href="http://algolist.manual.ru">http://algolist.manual.ru</a></li>
<li>MAXimal <a href="http://e-maxx.ru/algo/">http://e-maxx.ru/algo/</a></li>
<li>Визуализатор алгоритмов <a href="https://algorithm-visualizer.org">https://algorithm-visualizer.org</a></li>
<li>Data Structure Visualizations <a href="https://www.cs.usfca.edu/~galles/visualization/Algorithms.html">https://www.cs.usfca.edu/~galles/visualization/Algorithms.html</a></li>
<li><a href="https://www.geeksforgeeks.org/fundamentals-of-algorithms/">https://www.geeksforgeeks.org/fundamentals-of-algorithms/</a></li>
<li>Анимация алгоритмов сортировки <a href="https://www.toptal.com/developers/sorting-algorithms">https://www.toptal.com/developers/sorting-algorithms</a></li>
<li>Visualising data structures and algorithms through animation <a href="https://visualgo.net/en">https://visualgo.net/en</a></li>
<li><a href="https://codonaft.com/%D0%B0%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC%D1%8B-%D0%B8-%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D1%8B-%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85-%D0%BF%D1%80%D0%BE%D1%81%D1%82%D1%8B%D0%BC%D0%B8-%D1%81%D0%BB%D0%BE%D0%B2%D0%B0%D0%BC%D0%B8/?utm_source=youtube&amp;utm_medium=description&amp;utm_campaign=social">Алгоритмы и структуры данных простыми словами</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
